import cls from "./Features.module.scss";

export default function Features() {
  const features = [
    {
      title: "Быстрые выплаты",
      description:
        "Получайте средства на свой счет в кратчайшие сроки без задержек и комиссий",
    },
    {
      title: "Конкурсы",
      description: "Учавствуйте в конкурсах и выигрывайте призы",
    },
    {
      title: "Лояльность",
      description: "Получайте бонусы и скидки за каждое участие в конкурсах",
    },
  ];
  return (
    <section className={`section ${cls.features}`}>
      <div className="container">
        <div className={cls.features__title}>
          <h2>Преимущества</h2>
          <p>Мы предоставляем широкий спектр услуг для наших клиентов</p>
        </div>
        <div className={cls.features__inner}>
          {features.map((feature, index) => (
            <div className={cls.features__item} key={index}>
              <div className={cls.features__item__icon}>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="83"
                  height="83"
                  viewBox="0 0 83 83"
                  fill="none"
                >
                  <path
                    d="M51.5017 27.2376C51.5017 27.3581 51.478 27.4774 51.4319 27.5888C51.3858 27.7002 51.3183 27.8014 51.233 27.8866C51.1478 27.9718 51.0466 28.0394 50.9353 28.0855C50.8239 28.1316 50.7045 28.1553 50.584 28.1552L29.4522 28.1552L56.4206 55.1236C56.5926 55.2956 56.6893 55.5289 56.6893 55.7721C56.6893 56.0154 56.5926 56.2486 56.4206 56.4206C56.2486 56.5926 56.0154 56.6893 55.7721 56.6893C55.5289 56.6893 55.2956 56.5926 55.1236 56.4206L28.1552 29.4522L28.1552 50.584C28.1552 50.7045 28.1315 50.8239 28.0853 50.9352C28.0392 51.0465 27.9716 51.1477 27.8864 51.2329C27.8012 51.3181 27.7 51.3857 27.5887 51.4318C27.4774 51.4779 27.3581 51.5017 27.2375 51.5017C27.117 51.5017 26.9977 51.4779 26.8864 51.4318C26.775 51.3857 26.6739 51.3181 26.5887 51.2329C26.5035 51.1477 26.4359 51.0465 26.3898 50.9352C26.3436 50.8239 26.3199 50.7045 26.3199 50.584L26.3199 27.2376C26.3198 27.117 26.3435 26.9977 26.3896 26.8863C26.4357 26.775 26.5033 26.6738 26.5885 26.5885C26.6737 26.5033 26.7749 26.4357 26.8863 26.3896C26.9977 26.3435 27.117 26.3198 27.2375 26.3199L50.584 26.3199C50.7045 26.3198 50.8239 26.3435 50.9353 26.3896C51.0466 26.4357 51.1478 26.5033 51.233 26.5885C51.3183 26.6738 51.3859 26.7749 51.4319 26.8863C51.478 26.9977 51.5017 27.117 51.5017 27.2376Z"
                    fill="#FF5050"
                  />
                </svg>
              </div>
              <h3>{feature.title}</h3>
              <p>{feature.description}</p>
            </div>
          ))}
        </div>
      </div>
    </section>
  );
}
